{
  "backend/main.mo": "Minimal Motoko actor with no methods, serving as an empty backend placeholder.",
  "feature_evidence.json": "Feature evidence report confirming the comparison image feature is implemented in App.tsx and OurLittleComparisonSection.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files for reference during build planning.",
  "frontend/index.css": "Tailwind base/components/utilities imports plus OKLCH CSS custom property tokens for light and dark themes including colors, radii, and sidebar variables.",
  "frontend/index.html": "HTML entry point titled 'For My Ananya' that mounts the React app at the #root div via main.tsx.",
  "frontend/src/App.tsx": "Root React component that manages loading and modal state and composes all page sections including OurLittleComparisonSection in order.",
  "frontend/src/components/FloatingHearts.tsx": "Renders randomized animated heart SVGs floating upward from the bottom of the screen as a decorative background effect.",
  "frontend/src/components/Footer.tsx": "Page footer with animated floating hearts, 'Forever yours, Viaan.' signature in Dancing Script, and a caffeine.ai attribution link.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a pastel gradient background, floating hearts, hero image, main heading, and a glowing CTA button that triggers the romantic modal.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay with a pulsing heart SVG and 'Preparing something special for Ananya…' text that auto-fades out after ~2.9 seconds.",
  "frontend/src/components/LoveCounterSection.tsx": "Interactive section with a circular counter that increments on button click, shows burst emoji animations, and displays encouraging messages as the count grows.",
  "frontend/src/components/MusicToggle.tsx": "A fixed floating button component that plays/pauses a looping background music track, showing loading and playing states with animated styling.",
  "frontend/src/components/OurFutureSection.tsx": "A scroll-animated section displaying a vertical timeline of romantic future milestones (e.g., dates, marriage) with emoji icons and sparkle decorations.",
  "frontend/src/components/OurLittleComparisonSection.tsx": "A scroll-animated section showing a side-by-side comparison photo with a styled frame and an italic romantic caption below it.",
  "frontend/src/components/RomanticModal.tsx": "A modal overlay component displaying a short romantic message with animated heart/ring emojis and a close button.",
  "frontend/src/components/SecretMessageSection.tsx": "A scroll-animated section with a password-protected reveal, accepting a set of pet-name passwords to unlock a hidden romantic message.",
  "frontend/src/components/ThingsILoveSection.tsx": "A scroll-animated grid section displaying six cards, each highlighting a specific thing the author loves about their partner with an emoji, title, and description.",
  "frontend/src/hooks/useActor.ts": "A custom React hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom React hook that uses IntersectionObserver to track when an element enters the viewport, returning a ref and `isVisible` boolean for triggering scroll-based animations.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining a pastel romantic design system via CSS custom properties, Tailwind layers, and keyframe animations (float, sparkle, shimmer, fade-in, etc.).",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with romantic custom colors (oklch-based pastel palette), custom fonts, border radii, box shadows, and accordion keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing a romantic single-page website for Ananya (built with HTML/CSS/JS), listing existing features, architectural notes, known issues, and image requirements at schema version 7."
}